<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#교차분석-과제" data-toc-modified-id="교차분석-과제-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>교차분석 과제</a></span><ul class="toc-item"><li><span><a href="#titanic데이터에서-sex와-class-간의-동질성-검정을-진행하세요." data-toc-modified-id="titanic데이터에서-sex와-class-간의-동질성-검정을-진행하세요.-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>titanic데이터에서 sex와 class 간의 동질성 검정을 진행하세요.</a></span></li></ul></li></ul></div>

# 교차분석 과제 
## titanic데이터에서 sex와 class 간의 동질성 검정을 진행하세요.

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('../data/titanic.csv')
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,embark_town
0,0,3,male,22.0,1,0,7.2500,S,Third,True,Southampton
1,1,1,female,38.0,1,0,71.2833,C,First,False,Cherbourg
2,1,3,female,26.0,0,0,7.9250,S,Third,False,Southampton
3,1,1,female,35.0,1,0,53.1000,S,First,False,Southampton
4,0,3,male,35.0,0,0,8.0500,S,Third,True,Southampton
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,True,Southampton
887,1,1,female,19.0,0,0,30.0000,S,First,False,Southampton
888,0,3,female,NaN,1,2,23.4500,S,Third,False,Southampton
889,1,1,male,26.0,0,0,30.0000,C,First,True,Cherbourg
890,0,3,male,32.0,0,0,7.7500,Q,Third,True,Queenstown

- 귀무가설 : class의 분포는 sex에 관계없이 동일하다
- 대립가설 : class의 분포는 sex에 관계없이 동일하지 않다

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   adult_male   891 non-null    bool
 10  embark_town  889 non-null    object
dtypes: bool(1), float64(2), int64(4), object(4)
memory usage: 70.6+ KB

- 종속변수와 독립변수가 모두 범주형이므로 카이제곱 검정을 통해 교차분석을 실시한다

In [3]:
table = pd.crosstab(data['class'], data['sex'])
table

sex     female  male
class
First       94   122
Second      76   108
Third      144   347

In [4]:
from scipy.stats import chi2_contingency

chi, p, df, expect = chi2_contingency(table)
result = 'chi2 : {}, p-value : {}, df : {}'.format(chi, p, df)
print(result)

chi2 : 16.971499095517114, p-value : 0.00020638864348233114, df : 2

In [5]:
print(expect)

[[ 76.12121212 139.87878788]
 [ 64.84399551 119.15600449]
 [173.03479237 317.96520763]]

- p value가 유의수준(0.05)보다 작으므로 귀무가설(class의 분포는 sex에 관계없이 동일하다)을 기각한다
- 즉, 각 성별에 따라 class의 비율은 동일하지 않다고 할 수 있다

In [9]:
table2 = pd.crosstab(data['class'], data['sex'], normalize = 'columns') # normalize = 'index' 도 가능
table2

sex       female      male
class
First   0.299363  0.211438
Second  0.242038  0.187175
Third   0.458599  0.601386

- 위의 결과를 보면, 남성보다 여성이 First Class에 탑승한 비율이 높다